packages/archaea-simulation/archaea_simulation-1.1.20-py3-none-any.whl/archaea_simulation/cfd/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cell
{
    // cells to replace
};

convertToMeters 1;

vertices
(
    // vertices to replace
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $!cell/x
        $!cell/y
        $!cell/z
    )
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
            (4 7 6 5)
        );
    }

);

// ************************************************************************* //
